// Напишите программу, которая на вход
// принимает число и выдает его квадарат (число
// умноженное само на себя).

Console.WriteLine("Введите целое число: ");
int number = Convert.ToInt32(Console.ReadLine());
int square = number * number;
Console.WriteLine($"Квадрат числа {number} = {square}");

// double d = 4.566;
// string str - "Hello";
// bool b = true/false;

// int num = default;

// int -2 147 483 648 - 2 147 483 648